src/DataProcessors/КИИ_ДашбордОшибок/КИИ_ДашбордОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КИИ_ДашбордОшибок</name>
</mdclass:DataProcessor>

src/InformationRegisters/КИИ_МониторингОшибокЖурнал/КИИ_МониторингОшибокЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокЖурнал</name>
  <resources>
    <name>ПерваяДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееВхождение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтправок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Критичность</name>
    <type>
      <types>EnumRef.КИИ_УровниКритичности</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроанализированаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаАнализаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленаВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Игнорировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОтИИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/КИИ_ДашбордОшибок/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПериодДней = 30;
	СписокПериодов = Элементы.ПериодДней.СписокВыбора;
	СписокПериодов.Добавить(7, НСтр("ru = '7 дней'"));
	СписокПериодов.Добавить(14, НСтр("ru = '14 дней'"));
	СписокПериодов.Добавить(30, НСтр("ru = '30 дней'"));
	СписокПериодов.Добавить(90, НСтр("ru = '90 дней'"));

	// Растяжения HTML-поля не переживают выгрузку формы при обновлении конфигурации - задаем программно.
	Элементы.ПолеДашборд.РастягиватьПоГоризонтали = Истина;
	Элементы.ПолеДашборд.РастягиватьПоВертикали = Истина;

	ЗаполнитьДашборд();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)

	ЗаполнитьДашборд();

КонецПроцедуры

&НаКлиенте
Процедура ВключитьРегламенты(Команда)

	Создано = ВключитьРегламентыНаСервере();
	Если Создано > 0 Тогда
		ПоказатьОповещениеПользователя(
			СтрШаблон(НСтр("ru = 'Создано регламентных заданий: %1. Сбор и анализ работают по расписанию'"), Создано));
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Регламентные задания включены'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроанализироватьСейчас(Команда)

	ВыполнитьАнализНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Анализ ИИ выполнен, дашборд обновлен'"));

КонецПроцедуры

// Инструментальный (function-calling) анализ топ-ошибки: модель сама запрашивает данные базы
// через безопасные read-only инструменты и делает вывод по фактам, а не по догадкам.
&НаКлиенте
Процедура ГлубокийАнализ(Команда)

	ВыполнитьГлубокийАнализНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Глубокий анализ выполнен'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Регламентные задания расширения не предопределены - платформа не создает их экземпляры сама.
// Кнопка дает клиенту включить мониторинг без обращения к разработчику.
&НаСервере
Функция ВключитьРегламентыНаСервере()

	Результат = КИИ_МониторингОшибок.ИнициализироватьРегламентныеЗадания(Истина);
	ОбновитьСтатусРегламентов();
	Возврат Результат;

КонецФункции

// Текст индикатора состояния регламентных заданий рядом с периодом дашборда.
&НаСервере
Процедура ОбновитьСтатусРегламентов()

	Состояние = КИИ_МониторингОшибок.СостояниеРегламентов();
	Если Состояние.СборВключен И Состояние.АнализВключен Тогда
		СтатусРегламентов = НСтр("ru = 'Регламенты: включены'");
	ИначеЕсли Не Состояние.СборВключен И Не Состояние.АнализВключен Тогда
		СтатусРегламентов = НСтр("ru = 'Регламенты: ВЫКЛЮЧЕНЫ'");
	ИначеЕсли Состояние.СборВключен Тогда
		СтатусРегламентов = НСтр("ru = 'Регламенты: только сбор'");
	Иначе
		СтатусРегламентов = НСтр("ru = 'Регламенты: только анализ'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьАнализНаСервере()

	КИИ_МониторингОшибок.ВыполнитьАнализИИ();
	ЗаполнитьДашборд();

КонецПроцедуры

// Глубокий анализ самой частой ошибки инструментальным агентом. В HTML-дашборде нет таблицы
// для выбора строки, поэтому берем топ по количеству повторений - самое болезненное для клиента.
&НаСервере
Процедура ВыполнитьГлубокийАнализНаСервере()

	// Топ-ошибка по повторам за период дашборда; сам анализ - общий вход в модуле анализа
	// (он же используется командами форм списков журнала и статистики).
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Журнал.ХешОшибки КАК ХешОшибки
		|ИЗ
		|	РегистрСведений.КИИ_МониторингОшибокЖурнал КАК Журнал
		|ГДЕ
		|	НЕ Журнал.Игнорировать
		|	И Журнал.ПоследнееВхождение >= &ДатаНачала
		|УПОРЯДОЧИТЬ ПО
		|	Журнал.КоличествоПовторений УБЫВ";
	// Тот же период, что показывает дашборд (текущий день входит).
	ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаОкончания - (ПериодДней - 1) * 86400));
	Выборка = Запрос.Выполнить().Выбрать();

	Если Не Выборка.Следующий() Тогда
		РезультатГлубокогоАнализа = НСтр("ru = 'Нет ошибок для анализа.'");
		Возврат;
	КонецЕсли;

	ИтогАнализа = КИИ_МониторингОшибокАнализ.ВыполнитьГлубокийАнализОшибки(Выборка.ХешОшибки);
	РезультатГлубокогоАнализа = ИтогАнализа.Текст;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДашборд()

	Если ПериодДней < 1 Тогда
		ПериодДней = 30;
	КонецЕсли;

	ОбновитьСтатусРегламентов();

	Обработка = Обработки.КИИ_ДашбордОшибок.Создать();
	ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	// Текущий день ВХОДИТ в период: вычитаем на сутки меньше, иначе "7 дней" показывали бы восемь.
	ДатаНачала = НачалоДня(ДатаОкончания - (ПериодДней - 1) * 86400);
	HTMLДашборд = Обработка.ПостроитьHTMLДашборда(ДатаНачала, ДатаОкончания);

КонецПроцедуры

#КонецОбласти
